In [25]:
import pandas

In [26]:
marks = pandas.DataFrame([['Anil', 50, 75, 92, 68], ['Om',56, 74, 83, 88], ['Nidhi', 78, 82, 68, 58]],
                        columns = ['Name', 'Python', 'java', 'SQL', 'Visual Basics'], index=['first', 'second', 'third'])
marks

         Name  Python  java  SQL  Visual Basics
first    Anil      50    75   92             68
second     Om      56    74   83             88
third   Nidhi      78    82   68             58

In [27]:
print(marks)

         Name  Python  java  SQL  Visual Basics
first    Anil      50    75   92             68
second     Om      56    74   83             88
third   Nidhi      78    82   68             58

In [28]:
type(marks)

pandas.core.frame.DataFrame

In [29]:
marks.mean()

Python           61.333333
java             77.000000
SQL              81.000000
Visual Basics    71.333333
dtype: float64

In [30]:
marks.sum()

Name             AnilOmNidhi
Python                   184
java                     231
SQL                      243
Visual Basics            214
dtype: object

In [32]:
marks.mean().mean()

72.66666666666667

In [33]:
marks['Python']

first     50
second    56
third     78
Name: Python, dtype: int64

In [34]:
marks = marks.set_index('Name')

In [35]:
marks.java

Name
Anil     75
Om       74
Nidhi    82
Name: java, dtype: int64

In [9]:
df2=pandas.DataFrame([{"Name": "Gourav","last":"parmar"}, {"Name": "Raza","last":"Khan"}, {"Name":"Yash", "last":"Gandhi"}])
df2

     Name    last
0  Gourav  parmar
1    Raza    Khan
2    Yash  Gandhi

In [36]:
marks.T

Name           Anil  Om  Nidhi
Python           50  56     78
java             75  74     82
SQL              92  83     68
Visual Basics    68  88     58

In [38]:
marks.T.mean()

Name
Anil     71.25
Om       75.25
Nidhi    71.50
dtype: float64

In [50]:
total = marks.T.sum()

In [51]:
marks_T = marks.T
marks_T

Name           Anil  Om  Nidhi
Python           50  56     78
java             75  74     82
SQL              92  83     68
Visual Basics    68  88     58

In [53]:
marks_T['Percentage'] = marks_T.sum()
marks_T

Name           Anil  Om  Nidhi  Percentage
Python           50  56     78         NaN
java             75  74     82         NaN
SQL              92  83     68         NaN
Visual Basics    68  88     58         NaN

In [ ]:
import os